In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("AB_NYC_2019.csv")

In [3]:
df

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,8232441,Sabrina,Brooklyn,Bedford-Stuyvesant,40.67853,-73.94995,Private room,70,2,0,NaN,NaN,2,9
48891,36485057,Affordable room in Bushwick/East Williamsburg,6570630,Marisol,Brooklyn,Bushwick,40.70184,-73.93317,Private room,40,4,0,NaN,NaN,2,36
48892,36485431,Sunny Studio at Historical Neighborhood,23492952,Ilgar & Aysel,Manhattan,Harlem,40.81475,-73.94867,Entire home/apt,115,10,0,NaN,NaN,1,27
48893,36485609,43rd St. Time Square-cozy single bed,30985759,Taz,Manhattan,Hell's Kitchen,40.75751,-73.99112,Shared room,55,1,0,NaN,NaN,6,2
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,68119814,Christophe,Manhattan,Hell's Kitchen,40.76404,-73.98933,Private room,90,7,0,NaN,NaN,1,23

In [4]:
df.shape

(48895, 16)

In [6]:
df.columns

Index(['id', 'name', 'host_id', 'host_name', 'neighbourhood_group',
       'neighbourhood', 'latitude', 'longitude', 'room_type', 'price',
       'minimum_nights', 'number_of_reviews', 'last_review',
       'reviews_per_month', 'calculated_host_listings_count',
       'availability_365'],
      dtype='object')

In [15]:
# Make dataframe with old dataframe columns
df2=df[['id', 'name', 'room_type', 'price','minimum_nights']]

In [16]:
df2

,id,name,room_type,price,minimum_nights
0,2539,Clean & quiet apt home by the park,Private room,149,1
1,2595,Skylit Midtown Castle,Entire home/apt,225,1
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,Private room,150,3
3,3831,Cozy Entire Floor of Brownstone,Entire home/apt,89,1
4,5022,Entire Apt: Spacious Studio/Loft by central park,Entire home/apt,80,10
...,...,...,...,...,...
48890,36484665,Charming one bedroom - newly renovated rowhouse,Private room,70,2
48891,36485057,Affordable room in Bushwick/East Williamsburg,Private room,40,4
48892,36485431,Sunny Studio at Historical Neighborhood,Entire home/apt,115,10
48893,36485609,43rd St. Time Square-cozy single bed,Shared room,55,1
48894,36487245,Trendy duplex in the very heart of Hell's Kitchen,Private room,90,7

In [18]:
df2.shape

(48895, 5)

In [19]:
df2.describe()

                 id         price  minimum_nights
count  4.889500e+04  48895.000000    48895.000000
mean   1.901714e+07    152.720687        7.029962
std    1.098311e+07    240.154170       20.510550
min    2.539000e+03      0.000000        1.000000
25%    9.471945e+06     69.000000        1.000000
50%    1.967728e+07    106.000000        3.000000
75%    2.915218e+07    175.000000        5.000000
max    3.648724e+07  10000.000000     1250.000000

In [22]:
df2.price.mean()

152.7206871868289

In [23]:
df2.price.median()

106.0

In [24]:
df2.minimum_nights.mean()

7.029962163820431

In [25]:
df2.minimum_nights.median()

3.0

In [26]:
df2.minimum_nights.unique()

array([   1,    3,   10,   45,    2,    5,    4,   90,    7,   14,   60,
         29,   30,  180,    9,   31,    6,   15,    8,   26,   28,  200,
         50,   17,   21,   11,   25,   13,   35,   27,   18,   20,   40,
         44,   65,   55,  120,  365,  122,   19,  240,   88,  115,  150,
        370,   16,   80,  181,  265,  300,   59,  185,  360,   56,   12,
         70,   39,   24,   32, 1000,  110,  270,   22,   75,  250,   62,
         23, 1250,  364,   74,  198,  100,  500,   43,   91,  480,   53,
         99,  160,   47,  999,  186,  366,   68,   93,   87,  183,  299,
        175,   98,  133,  354,   42,   33,   37,  225,  400,  105,  184,
        153,  134,  222,   58,  210,  275,  182,  114,   85,   36],
      dtype=int64)

In [27]:
df2.price.unique()

array([  149,   225,   150,    89,    80,   200,    60,    79,   135,
          85,   120,   140,   215,    99,   190,   299,   130,   110,
          44,   180,    50,    52,    55,    70,    35,    40,    68,
         115,   151,   228,   144,    69,    49,   375,   250,   275,
         230,    51,    65,   105,    95,   145,   285,    94,   800,
         131,    98,   100,   125,   175,   500,   101,   220,    59,
         350,   199,   325,   235,   170,   400,    75,    90,   185,
          77,    76,   160,   195,   156,   219,   475,   165,   196,
          83,   123,   265,   249,   121,    45,    71,    64,   159,
         189,   239,   305,   155,    92,    36,    37,   205,    39,
         390,   129,   212,   124,   122,   109,   575,   229,   169,
         113,   179,   349,   139,   650,    67,   599,   211,   290,
          87,   395,   260,    97,   132,   141,   495,   259,    96,
         295,   451,   300,    42,   255,    72,    88,   450,   198,
          46,    33,   106,    91,  2000,   429,   107,    43,   248,
          41,   157,   172,   146,   116,   288,   270,   241,   399,
         438,   279,   137,   280,   226,   154,   700,   246,   119,
         850,    81,    54,   760,    48,    58,   153,    73,   485,
         310,   167,   147,    34,    93,    56,  1300,   127,   402,
          30,   240,   385,    47,   209,   192,    86,   245,   499,
         387,   178,  3000,   549,    20,    74,   104,   298,   269,
         138,   208,   142,   174,   315,   210,   311,    82,   117,
         380,   328,   102,   118,   217,   152,   197,   133,   331,
         128,   136,   148,  1000,   263,   433,    61,   234,   595,
         108,   355,   134,    62,   550,    84,    78,   900,   103,
         330,   425,   168,    66,   625,   171,   187,   600,   312,
          38,   163,   158,   173,   465,    63,   340,    57,  4000,
         999,   289,   166,   176,   339,   191,  2500,   329,   890,
          53,   420,   950,   334,  1395,   221,   182,   750,   181,
         112,  1500,  1899,   188,   262,   111,   162,    29,   232,
        5000,   345,  1100,   224,    10,   194,    31,  1200,   440,
         439,   555,   143,   184,   799,   455,   193,   161,   201,
        1700,   525,    32,   251,  1999,   480,   320,   164,   272,
         177,   560,  6000,   379,   303,   675,   749,  5250,  1550,
        1250,  1485,   369,  6500,  2750,  3750,  1600,   975,    25,
          18,  2300,   409,   218,   430,  4500,  8000,   795,   414,
         126,    16,   785,   370,    22,   316,   264,   318,   273,
         308,   365,   216,   545,   860,   540,   233,  1400,   383,
         419,  1050,  2695,   985,   360,   699,   227,   247,   895,
        9999,   258,  2400,   254,   346,   415,   995,  1763,   510,
        1450,   281,    27,    28,   825,   524,   202,   244,   114,
         341,   257,   322,   276,   207,   445,   284,   449,   680,
        1495,   256,   888,   389,   460, 10000,   222,   243,   267,
         398,   386,   319,   238,   374,   490,   335,  1195,   203,
         469,   186,   352,   297,   237,   745,   410,  1170,   261,
        1150,   434,   590,   899,   304,   296,   183,   531,   214,
         655,    24,   477,   372,   206,    26,   587,   204,  1731,
        1002,   333,   283,   814,  1800,   278,   421,   690,   619,
        2100,   348,   223,   268,   359,   436,   935,   274,   376,
         980,   294,   559,   509,   301,   408,  3800,   479,  2350,
         822,    23,   407,   489,   252,   672,   378,   584,   894,
         643,   462,   649,   302,   321,   534,   748,   487,   236,
        1020,    19,  1599,    21,   585,  2590,    11,   640,   459,
          12,  2250,   484,   337,   317,    15,  2800,  1475,   615,
        2900,   287,     0,   515,  1067,   424,   578,   789,  1795,
        1095,   530,  3900,   496,   435,   422,   367,   695,  1177,
         790,   253,   573,   766,   231,   840,   577,   589,   949,
         358,   213,  2200,   497,  1066,   412,   647,   277,   720,
        2010,  3210,  4160,  1046,   271,   416,  1680,  7703,  3518,
        6419,  2626,  2103,  8500,  2990,   620,   394,   323,   974,
         344,  1333,   780,   347,   393,   309,   483,   737,   470,
         689,   639,   848,   403,   471,   377,   282,   314,   478,
         670,  2545,  1115,   520,   913,   505,   718,   692,  3600,
         307,   306,  1880,   714,   956,   266,   292,  2999,   418,
         452,   397,   343,   291,   392,   356,   242,   396,   332,
         361,   453,   481,   466,   388,   423,   362,   313,   805,
         725,   443,  1350,  3200,   293,   432,   444,  1075,   820,
         373,  1750,  1080,  1299,  1295,   519,  1978,  1494,  3512,
         382,   404,   503,   472,   454,   431,   468,   498,   612,
         488,  1497,  2850,   990,   506,   324,  1315,   446,  7500,
        3613,  2600,  4100,   794,  1145,  1306,   336,  5100,   898,
         327,   442,   474,  1799,   353,  4200,   616,  6800,   945,
         539,   426,   875,   463,   688,   580,   583,   381,  1900,
         659,   830,    13,   447,  1099,   428,   920,   930,  2995,
         342,   843,   417,  1308,   561,  1369,  1749,   338],
      dtype=int64)

In [28]:
df2.nunique()

id                48895
name              47905
room_type             3
price               674
minimum_nights      109
dtype: int64

In [30]:
df2.isnull().sum()

id                 0
name              16
room_type          0
price              0
minimum_nights     0
dtype: int64

In [58]:
Max_thresold=df2.price.quantile(0.99)

In [42]:
Min_thresold=df2.price.quantile(0.01)

In [60]:
Max_thresold,Min_thresold

(799.0, 30.0)

In [61]:
df2[df2.price>Max_thresold].shape

(474, 5)

In [49]:
df2[df2.price<Min_thresold].shape

(404, 5)